---
kind: property
id: P:Autodesk.Revit.DB.Document.Create
zh: 创建、新建、生成、建立、新增
source: html/f87f97d5-8402-62b5-4d6d-defe60c8f8ee.htm
---
# Autodesk.Revit.DB.Document.Create Property

**中文**: 创建、新建、生成、建立、新增

An object that can be used to create new instances of Autodesk Revit API elements
within a project.

## Syntax (C#)
```csharp
public Document Create { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the current document is family document.